"""Необходим модуль для провери всей поступающей из ввода информации на допустимость к использованию."""
# 1) Проверка на тип словаря
# 2) Проверка на размер буквы, ЕСЛИ тип словаря 'словарь' собственно
# 3) Проверка количества символов, используемых в символьном ряду
# 4) Проверка допустимости значений интервала
# 5) Проверка длинны итогового списка
#       5.1) Сразу скажу, что итоговый список должен генерироваться с помощью запроса...
#            ... времени тестирования и скорости показа стимулов в стимульном ряду.

"""Название функции и объяснение её работы."""

